package sr

import "time"

const (
	ErrorMessage = "" +
		`Покушајте поново - две станице, раздвојене зарезом. Као овако:

Подгорица, Бар`

	StationDoesNotExistMessage   = "Ова станица не постоји"
	RailwayMapButtonTextMap      = "Karta železnica Crne Gore"
	OfficialTimetableUrlText     = "Више информација"
	ReverseRouteInlineButtonText = "Обрнуто"
	SimpleUpdateNotificationText = "Данашњи распоред је приказан"

	// bot description

	BotName        = "🚂 Црна Гора: распоред возова | Crna Gora ZPCG RED VOŽNJE"
	BotDescription = "" +
		`> Ажуран распоред
> Зна сваку станицу, укључујући Београд
> Може приказати руте између било које две станице, укључујући трансфер

Просто унесите две станице раздвојене зарезом:

Подгорица, Бар`
	BotShortDescription = "Ажуран распоред са свим станицама и рутама, укључујући руте са трансфером и међународне, као што је воз Београд - Бар"

	// bot commands

	BotCommandNameStart = "Покрени бота"
	StartMessage        = "" +
		`*Распоред железнице Црне Горе*

_Направљено уз помоћ @Leti\_deshevle_

Молим вас унесите *две станице* раздвојене *зарезом*: 

>*Podgorica, Bar*

Iли користећи ћирилицу:

>*Подгорица, Бар*

`

	// /help

	BotCommandNameHelp = "Помоћ"
	HelpMessage        = "" +
		`Често постављана питања на која се често дају одговори:

1. Ово је бот за ред вожње возова у Црној Гори. Ред вожње такође укључује возове који иду ка/из Србије у Црну Гору.
2. Ниједна друга земља нема железничке везе са Црном Гором, само Србија.
3. Проверите мапу станице преко /map
4. Само унесите две станице одвојене зарезима: „Подгорица, Бар“ и добићете ред вожње.
5. Карте се могу купити само на станици или у возу. Само готовина, нема онлајн карата, понекад се картице прихватају на неким станицама (да, понекад).
6. Проверите цену, попусте и остале детаље кликом на линк „Више детаља“ на дну распореда.
7. Ред вожње остаје исти током целе године, са изузетком једног летњег воза. Остатак распореда остаје потпуно исти.
8. Ажурирајте распоред помоћу левог дугмета „🔄 'датум'“
9. Понекад возови касне, посебно током летње сезоне.
10. Детаљније информације о боту преко /about
`

	// /map

	BotCommandNameMap = "Мапа свих станица"
	MapMessage        = "Мапа са свим станицама"

	// /about

	BotCommandNameAbout = "О овом боту"
	AboutMessage        = "" +
		`Овај бот је доступан под BEERWARE лиценцом.

Докле год видите ово обавештење, можете да радите шта год желите са овим кодом и овим ботом.
Ако се икада сретнемо и помислиш,
да је овај бот користан - можеш ми купити пиво као знак захвалности.

Више волим Никшићко тамно.

https://github.com/ivanov-gv/zpcg

Направљено заједно са @Leti_deshevle
`
)

var MonthsMap = map[time.Month]string{
	time.January:   "Јануар",
	time.February:  "Фебруар",
	time.March:     "Март",
	time.April:     "Април",
	time.May:       "Мај",
	time.June:      "Јун",
	time.July:      "Јул",
	time.August:    "Август",
	time.September: "Септембар",
	time.October:   "Октобар",
	time.November:  "Новембар",
	time.December:  "Децембар",
}
