package uk

import "time"

const (
	ErrorMessage = "" +
		`Спробуйте ще раз - дві станції через кому. Ось так:

Podgorica, Niksic`

	StationDoesNotExistMessage   = "Такої станції не існує"
	RailwayMapButtonTextMap      = "Карта Залізниці Чорногорії"
	OfficialTimetableUrlText     = "Детальніше"
	ReverseRouteInlineButtonText = "Назад"
	AlertUpdateNotificationText  = "" +
		`Розклад вже оновлено
З 13.06.2026 по 14.09.2026 додастся поїзд Суботица - Бар

В іншому розклад не зміниться`
	SimpleUpdateNotificationText = "Розклад на сьогодні оновлено"

	// опис бота

	BotName        = "🚂 Чорногорія: розклад поїздів і електричок | Черногория поезд"
	BotDescription = "" +
		`> Актуальний розклад
> Знає всі станції, включаючи Белград
> Вміє будувати маршрути з пересадкою

Просто введіть дві станції через кому:

Подгорица, Бар`
	BotShortDescription = "Актуальний розклад з усіма станціями і маршрутами, включаючи маршрути з пересадкою і поїзд Белград - Бар"

	// команди бота

	BotCommandNameStart = "Старт бота"
	StartMessage        = "" +
		`*Розклад електричок Чорногорії*

_Зроблено разом з @Leti\_deshevle_

Будь ласка, введіть *дві станції через кому* латиницею: 

>*Podgorica, Bijelo Polje*

або кирилицею: 

>*Подгорица, Бело Поле*

І отримайте розклад:

>Podgorica \> Bijelo Polje
>[6100](https://zpcg.me/details?timetable=41)  ` + "`06:20 \\> 08:38`" + `
>\.\.\.

Не впевнені як правильно пишеться назва станції? Напишіть як знаєте \- ми здогадаємося, що ви мали на увазі\.

Тепер ваша черга\!
`

	// /help

	BotCommandNameHelp = "Допомога"
	HelpMessage        = "" +
		`Часті відповіді на запитання, що часто ставляться:

1. Це бот для розкладу поїздів до Чорногорії. У розкладі також є поїзди, що йдуть у/з Сербії до Чорногорії.
2. Жодні інші країни не мають залізничного сполучення з Чорногорією, лише Сербія.
3. Перевірте карту станцій через /map
4. Просто введіть дві станції через кому: 'Підгориця, Бар', і ви отримаєте розклад.
5. Квитки можна купити тільки на станції чи поїзді. Тільки готівка, онлайн-квитків немає, іноді картки приймаються на деяких станціях (так, іноді).
6. Перевірте ціну, знижки та інші деталі за посиланням 'Докладніше' внизу розкладу.
7. Розклад залишається незмінним протягом року, крім одного літнього поїзда. Решта розкладу залишається таким самим.
8. Оновіть розклад за допомогою лівої кнопки "🔄 'дата'"
9. Іноді потяги спізнюються, особливо у літній сезон.
10. Більш детальна інформація про бот через /about
`

	// /map

	BotCommandNameMap = "Карта всіх станцій"
	MapMessage        = "Карта з усіма станціями"

	// /about

	BotCommandNameAbout = "Про цього бота"
	AboutMessage        = "" +
		`Цей бот доступний за ліцензією BEERWARE.

Поки ви бачите це повідомлення, ви можете робити з цим кодом та цим ботом все, що захочете.
Якщо ми колись зустрінемося, і ви вважаєте,
що цей бот корисний - ви можете купити мені пиво як подяку.

Я віддаю перевагу Нікшичку там.

Я: https://github.com/ivanov-gv
Цей проект: https://github.com/ivanov-gv/zpcg

Зроблено разом з @Leti_deshevle
`
)

var MonthsMap = map[time.Month]string{
	time.January:   "Січня",
	time.February:  "Лютого",
	time.March:     "Березня",
	time.April:     "Квітня",
	time.May:       "Травня",
	time.June:      "Червня",
	time.July:      "Липня",
	time.August:    "Серпня",
	time.September: "Вересня",
	time.October:   "Жовтня",
	time.November:  "Листопада",
	time.December:  "Грудня",
}
