package render

const ErrorMessageRu = `Попробуйте снова - две станции на латинице, через запятую. Вот так:

Podgorica, Niksic`

const StartMessageRu = "" +
	"*Расписание электричек Черногории*\n" +
	"\n" +
	"_Сделан вместе с @Leti\\_deshevle_\n" +
	"\n" +
	"Пожалуйста, введите *две станции через запятую на латинице*: \n" +
	"\n" +
	">*Podgorica, Bijelo Polje*\n" +
	"\n" +
	"И получите расписание:\n" +
	"\n" +
	">Podgorica \\> Bijelo Polje\n" +
	">[6100](https://zpcg.me/details?timetable=41)  `06:20 \\> 08:38` \n" +
	">\\.\\.\\.\n" +
	"\n" +
	"Не уверены как правильно пишется название станции? Напишите как знаете \\- мы догадаемся что вы имели ввиду\\.\n" +
	"\n" +
	"Теперь ваша очередь\\!"
